; domain
(define (domain drone-domain)


(:requirements :strips :typing )


(:types
    person crate food medicine location drone - object
)


(:predicates
    (at ?o - object ?l - location)
    (crate-content ?b - crate ?content - object)
    (person-needs ?p - person ?content - object)
    (person-has ?p - person ?content - object)
    (arm1-free ?d - drone)
    (arm1-load ?d - drone ?b - crate)
    (arm2-free ?d - drone)
    (arm2-load ?d - drone ?b - crate)
)


(:action move-drone
    :parameters (
        ?drone - drone ?origin - location ?destination - location 
    )
    :precondition (and 
        (at ?drone ?origin)
    )
    :effect (and 
        (not (at ?drone ?origin))
        (at ?drone ?destination)
    )
)

(:action grab-arm1
    :parameters (
        ?d - drone ?b - crate ?l - location
    )
    :precondition (and 
        (at ?d ?l)
        (at ?b ?l)
        (arm1-free ?d)
    )
    :effect (and 
        (not (arm1-free ?d))
        (arm1-load ?d ?b)
        (not (at ?b ?l))
    )
)

(:action grab-arm2
    :parameters (
        ?d - drone ?b - crate ?l - location
    )
    :precondition (and 
        (at ?d ?l)
        (at ?b ?l)
        (arm2-free ?d)
    )
    :effect (and 
        (not (arm2-free ?d))
        (arm2-load ?d ?b)
        (not (at ?b ?l))
    )
)

(:action deliver-arm1
    :parameters (
        ?d - drone ?p - person ?b - crate ?content - object ?l - location
    )
    :precondition (and 
        (arm1-load ?d ?b)
        (at ?d ?l)
        (at ?p ?l)
        (crate-content ?b ?content)
        (person-needs ?p ?content)
    )
    :effect (and 
        (not (arm1-load ?d ?b))
        (arm1-free ?d)
        (not (person-needs ?p ?content))
        (person-has ?p ?content)
    )
)

(:action deliver-arm2
    :parameters (
        ?d - drone ?p - person ?b - crate ?content - object ?l - location
    )
    :precondition (and 
        (arm2-load ?d ?b)
        (at ?d ?l)
        (at ?p ?l)
        (crate-content ?b ?content)
        (person-needs ?p ?content)
    )
    :effect (and 
        (not (arm2-load ?d ?b))
        (arm2-free ?d)
        (not (person-needs ?p ?content))
        (person-has ?p ?content)
    )
)


)

; problem
(define (problem drone_problem_d1_r0_l17_p17_c17_g17_ct2)
(:domain drone-domain)
(:objects
	drone1 - drone
	depot - location
	loc1 - location
	loc2 - location
	loc3 - location
	loc4 - location
	loc5 - location
	loc6 - location
	loc7 - location
	loc8 - location
	loc9 - location
	loc10 - location
	loc11 - location
	loc12 - location
	loc13 - location
	loc14 - location
	loc15 - location
	loc16 - location
	loc17 - location
	crate1 - crate
	crate2 - crate
	crate3 - crate
	crate4 - crate
	crate5 - crate
	crate6 - crate
	crate7 - crate
	crate8 - crate
	crate9 - crate
	crate10 - crate
	crate11 - crate
	crate12 - crate
	crate13 - crate
	crate14 - crate
	crate15 - crate
	crate16 - crate
	crate17 - crate
	food - contents
	medicine - contents
	person1 - person
	person2 - person
	person3 - person
	person4 - person
	person5 - person
	person6 - person
	person7 - person
	person8 - person
	person9 - person
	person10 - person
	person11 - person
	person12 - person
	person13 - person
	person14 - person
	person15 - person
	person16 - person
	person17 - person
)
(:init
	(at drone1 depot)
	(arm1-free drone1)
	(arm2-free drone1)
	(at crate1 depot)
	(at crate2 depot)
	(at crate3 depot)
	(at crate4 depot)
	(at crate5 depot)
	(at crate6 depot)
	(at crate7 depot)
	(at crate8 depot)
	(at crate9 depot)
	(at crate10 depot)
	(at crate11 depot)
	(at crate12 depot)
	(at crate13 depot)
	(at crate14 depot)
	(at crate15 depot)
	(at crate16 depot)
	(at crate17 depot)
	(crate-content crate1 food)
	(crate-content crate2 food)
	(crate-content crate3 food)
	(crate-content crate4 food)
	(crate-content crate5 food)
	(crate-content crate6 food)
	(crate-content crate7 food)
	(crate-content crate8 food)
	(crate-content crate9 food)
	(crate-content crate10 food)
	(crate-content crate11 food)
	(crate-content crate12 food)
	(crate-content crate13 food)
	(crate-content crate14 food)
	(crate-content crate15 medicine)
	(crate-content crate16 medicine)
	(crate-content crate17 medicine)
	(at person1 loc8)
	(at person2 loc5)
	(at person3 loc1)
	(at person4 loc12)
	(at person5 loc11)
	(at person6 loc12)
	(at person7 loc14)
	(at person8 loc10)
	(at person9 loc5)
	(at person10 loc10)
	(at person11 loc5)
	(at person12 loc9)
	(at person13 loc14)
	(at person14 loc5)
	(at person15 loc4)
	(at person16 loc3)
	(at person17 loc6)
	(person-needs person1 food)
	(person-needs person3 food)
	(person-needs person4 food)
	(person-needs person4 medicine)
	(person-needs person5 food)
	(person-needs person6 food)
	(person-needs person6 medicine)
	(person-needs person7 food)
	(person-needs person8 food)
	(person-needs person10 food)
	(person-needs person11 food)
	(person-needs person12 food)
	(person-needs person12 medicine)
	(person-needs person13 food)
	(person-needs person14 food)
	(person-needs person15 food)
	(person-needs person16 food)
)
(:goal (and
	(at drone1 depot)
	(person-has person1 food)
	(person-has person3 food)
	(person-has person4 food)
	(person-has person4 medicine)
	(person-has person5 food)
	(person-has person6 food)
	(person-has person6 medicine)
	(person-has person7 food)
	(person-has person8 food)
	(person-has person10 food)
	(person-has person11 food)
	(person-has person12 food)
	(person-has person12 medicine)
	(person-has person13 food)
	(person-has person14 food)
	(person-has person15 food)
	(person-has person16 food)
	))
)

; plan
1. (grab-arm2 drone1 crate16 depot)
   deleted: (arm2-free drone1) (at crate16 depot)
   added: (arm2-load drone1 crate16)
   goals met: 1 of 18
2. (grab-arm1 drone1 crate17 depot)
   deleted: (arm1-free drone1) (at crate17 depot)
   added: (arm1-load drone1 crate17)
   goals met: 1 of 18
3. (move-drone drone1 depot loc10)
   deleted: (at drone1 depot)
   added: (at drone1 loc10)
   goals met: 0 of 18
4. (move-drone drone1 loc10 loc12)
   deleted: (at drone1 loc10)
   added: (at drone1 loc12)
   goals met: 0 of 18
5. (deliver-arm1 drone1 person6 crate17 medicine loc12)
   deleted: (arm1-load drone1 crate17) (person-needs person6 medicine)
   added: (arm1-free drone1) (person-has person6 medicine)
   goals met: 1 of 18
6. (move-drone drone1 loc12 depot)
   deleted: (at drone1 loc12)
   added: (at drone1 depot)
   goals met: 2 of 18
7. (grab-arm1 drone1 crate15 depot)
   deleted: (arm1-free drone1) (at crate15 depot)
   added: (arm1-load drone1 crate15)
   goals met: 2 of 18
8. (move-drone drone1 depot loc9)
   deleted: (at drone1 depot)
   added: (at drone1 loc9)
   goals met: 1 of 18
9. (deliver-arm1 drone1 person12 crate15 medicine loc9)
   deleted: (arm1-load drone1 crate15) (person-needs person12 medicine)
   added: (arm1-free drone1) (person-has person12 medicine)
   goals met: 2 of 18
10. (move-drone drone1 loc9 depot)
   deleted: (at drone1 loc9)
   added: (at drone1 depot)
   goals met: 3 of 18
11. (move-drone drone1 depot loc16)
   deleted: (at drone1 depot)
   added: (at drone1 loc16)
   goals met: 2 of 18
12. (move-drone drone1 loc16 loc12)
   deleted: (at drone1 loc16)
   added: (at drone1 loc12)
   goals met: 2 of 18
13. (deliver-arm2 drone1 person4 crate16 medicine loc12)
   deleted: (arm2-load drone1 crate16) (person-needs person4 medicine)
   added: (arm2-free drone1) (person-has person4 medicine)
   goals met: 3 of 18
14. (move-drone drone1 loc12 depot)
   deleted: (at drone1 loc12)
   added: (at drone1 depot)
   goals met: 4 of 18
15. (grab-arm2 drone1 crate14 depot)
   deleted: (arm2-free drone1) (at crate14 depot)
   added: (arm2-load drone1 crate14)
   goals met: 4 of 18
16. (grab-arm1 drone1 crate1 depot)
   deleted: (arm1-free drone1) (at crate1 depot)
   added: (arm1-load drone1 crate1)
   goals met: 4 of 18
17. (move-drone drone1 depot loc10)
   deleted: (at drone1 depot)
   added: (at drone1 loc10)
   goals met: 3 of 18
18. (move-drone drone1 loc10 loc8)
   deleted: (at drone1 loc10)
   added: (at drone1 loc8)
   goals met: 3 of 18
19. (deliver-arm2 drone1 person1 crate14 food loc8)
   deleted: (arm2-load drone1 crate14) (person-needs person1 food)
   added: (arm2-free drone1) (person-has person1 food)
   goals met: 4 of 18
20. (move-drone drone1 loc8 loc11)
   deleted: (at drone1 loc8)
   added: (at drone1 loc11)
   goals met: 4 of 18
21. (deliver-arm1 drone1 person5 crate1 food loc11)
   deleted: (arm1-load drone1 crate1) (person-needs person5 food)
   added: (arm1-free drone1) (person-has person5 food)
   goals met: 5 of 18
22. (move-drone drone1 loc11 loc7)
   deleted: (at drone1 loc11)
   added: (at drone1 loc7)
   goals met: 5 of 18
23. (move-drone drone1 loc7 depot)
   deleted: (at drone1 loc7)
   added: (at drone1 depot)
   goals met: 6 of 18
24. (grab-arm1 drone1 crate10 depot)
   deleted: (arm1-free drone1) (at crate10 depot)
   added: (arm1-load drone1 crate10)
   goals met: 6 of 18
25. (move-drone drone1 depot loc12)
   deleted: (at drone1 depot)
   added: (at drone1 loc12)
   goals met: 5 of 18
26. (deliver-arm1 drone1 person6 crate10 food loc12)
   deleted: (arm1-load drone1 crate10) (person-needs person6 food)
   added: (arm1-free drone1) (person-has person6 food)
   goals met: 6 of 18
27. (move-drone drone1 loc12 depot)
   deleted: (at drone1 loc12)
   added: (at drone1 depot)
   goals met: 7 of 18
28. (grab-arm1 drone1 crate9 depot)
   deleted: (arm1-free drone1) (at crate9 depot)
   added: (arm1-load drone1 crate9)
   goals met: 7 of 18
29. (grab-arm2 drone1 crate8 depot)
   deleted: (arm2-free drone1) (at crate8 depot)
   added: (arm2-load drone1 crate8)
   goals met: 7 of 18
30. (move-drone drone1 depot loc12)
   deleted: (at drone1 depot)
   added: (at drone1 loc12)
   goals met: 6 of 18
31. (deliver-arm1 drone1 person4 crate9 food loc12)
   deleted: (arm1-load drone1 crate9) (person-needs person4 food)
   added: (arm1-free drone1) (person-has person4 food)
   goals met: 7 of 18
32. (move-drone drone1 loc12 loc14)
   deleted: (at drone1 loc12)
   added: (at drone1 loc14)
   goals met: 7 of 18
33. (deliver-arm2 drone1 person7 crate8 food loc14)
   deleted: (arm2-load drone1 crate8) (person-needs person7 food)
   added: (arm2-free drone1) (person-has person7 food)
   goals met: 8 of 18
34. (move-drone drone1 loc14 depot)
   deleted: (at drone1 loc14)
   added: (at drone1 depot)
   goals met: 9 of 18
35. (grab-arm1 drone1 crate4 depot)
   deleted: (arm1-free drone1) (at crate4 depot)
   added: (arm1-load drone1 crate4)
   goals met: 9 of 18
36. (move-drone drone1 depot loc10)
   deleted: (at drone1 depot)
   added: (at drone1 loc10)
   goals met: 8 of 18
37. (deliver-arm1 drone1 person8 crate4 food loc10)
   deleted: (arm1-load drone1 crate4) (person-needs person8 food)
   added: (arm1-free drone1) (person-has person8 food)
   goals met: 9 of 18
38. (move-drone drone1 loc10 depot)
   deleted: (at drone1 loc10)
   added: (at drone1 depot)
   goals met: 10 of 18
39. (grab-arm1 drone1 crate7 depot)
   deleted: (arm1-free drone1) (at crate7 depot)
   added: (arm1-load drone1 crate7)
   goals met: 10 of 18
40. (move-drone drone1 depot loc16)
   deleted: (at drone1 depot)
   added: (at drone1 loc16)
   goals met: 9 of 18
41. (move-drone drone1 loc16 loc10)
   deleted: (at drone1 loc16)
   added: (at drone1 loc10)
   goals met: 9 of 18
42. (deliver-arm1 drone1 person10 crate7 food loc10)
   deleted: (arm1-load drone1 crate7) (person-needs person10 food)
   added: (arm1-free drone1) (person-has person10 food)
   goals met: 10 of 18
43. (move-drone drone1 loc10 depot)
   deleted: (at drone1 loc10)
   added: (at drone1 depot)
   goals met: 11 of 18
44. (grab-arm1 drone1 crate2 depot)
   deleted: (arm1-free drone1) (at crate2 depot)
   added: (arm1-load drone1 crate2)
   goals met: 11 of 18
45. (grab-arm2 drone1 crate5 depot)
   deleted: (arm2-free drone1) (at crate5 depot)
   added: (arm2-load drone1 crate5)
   goals met: 11 of 18
46. (move-drone drone1 depot loc5)
   deleted: (at drone1 depot)
   added: (at drone1 loc5)
   goals met: 10 of 18
47. (deliver-arm1 drone1 person11 crate2 food loc5)
   deleted: (arm1-load drone1 crate2) (person-needs person11 food)
   added: (arm1-free drone1) (person-has person11 food)
   goals met: 11 of 18
48. (move-drone drone1 loc5 loc9)
   deleted: (at drone1 loc5)
   added: (at drone1 loc9)
   goals met: 11 of 18
49. (deliver-arm2 drone1 person12 crate5 food loc9)
   deleted: (arm2-load drone1 crate5) (person-needs person12 food)
   added: (arm2-free drone1) (person-has person12 food)
   goals met: 12 of 18
50. (move-drone drone1 loc9 depot)
   deleted: (at drone1 loc9)
   added: (at drone1 depot)
   goals met: 13 of 18
51. (grab-arm2 drone1 crate6 depot)
   deleted: (arm2-free drone1) (at crate6 depot)
   added: (arm2-load drone1 crate6)
   goals met: 13 of 18
52. (grab-arm1 drone1 crate3 depot)
   deleted: (arm1-free drone1) (at crate3 depot)
   added: (arm1-load drone1 crate3)
   goals met: 13 of 18
53. (move-drone drone1 depot loc1)
   deleted: (at drone1 depot)
   added: (at drone1 loc1)
   goals met: 12 of 18
54. (deliver-arm2 drone1 person3 crate6 food loc1)
   deleted: (arm2-load drone1 crate6) (person-needs person3 food)
   added: (arm2-free drone1) (person-has person3 food)
   goals met: 13 of 18
55. (move-drone drone1 loc1 loc14)
   deleted: (at drone1 loc1)
   added: (at drone1 loc14)
   goals met: 13 of 18
56. (deliver-arm1 drone1 person13 crate3 food loc14)
   deleted: (arm1-load drone1 crate3) (person-needs person13 food)
   added: (arm1-free drone1) (person-has person13 food)
   goals met: 14 of 18
57. (move-drone drone1 loc14 depot)
   deleted: (at drone1 loc14)
   added: (at drone1 depot)
   goals met: 15 of 18
58. (grab-arm1 drone1 crate12 depot)
   deleted: (arm1-free drone1) (at crate12 depot)
   added: (arm1-load drone1 crate12)
   goals met: 15 of 18
59. (grab-arm2 drone1 crate13 depot)
   deleted: (arm2-free drone1) (at crate13 depot)
   added: (arm2-load drone1 crate13)
   goals met: 15 of 18
60. (move-drone drone1 depot loc5)
   deleted: (at drone1 depot)
   added: (at drone1 loc5)
   goals met: 14 of 18
61. (deliver-arm1 drone1 person14 crate12 food loc5)
   deleted: (arm1-load drone1 crate12) (person-needs person14 food)
   added: (arm1-free drone1) (person-has person14 food)
   goals met: 15 of 18
62. (move-drone drone1 loc5 loc4)
   deleted: (at drone1 loc5)
   added: (at drone1 loc4)
   goals met: 15 of 18
63. (deliver-arm2 drone1 person15 crate13 food loc4)
   deleted: (arm2-load drone1 crate13) (person-needs person15 food)
   added: (arm2-free drone1) (person-has person15 food)
   goals met: 16 of 18
64. (move-drone drone1 loc4 depot)
   deleted: (at drone1 loc4)
   added: (at drone1 depot)
   goals met: 17 of 18
65. (grab-arm1 drone1 crate11 depot)
   deleted: (arm1-free drone1) (at crate11 depot)
   added: (arm1-load drone1 crate11)
   goals met: 17 of 18
66. (move-drone drone1 depot loc3)
   deleted: (at drone1 depot)
   added: (at drone1 loc3)
   goals met: 16 of 18
67. (deliver-arm1 drone1 person16 crate11 food loc3)
   deleted: (arm1-load drone1 crate11) (person-needs person16 food)
   added: (arm1-free drone1) (person-has person16 food)
   goals met: 17 of 18
68. (move-drone drone1 loc3 depot)
   deleted: (at drone1 loc3)
   added: (at drone1 depot)
   goals met: 18 of 18
